Repository: mokaleriya-26/Mini_Project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hi, ml, mr

source: From Tweets To Trades — Dashboard (NIFTY 50)
hi: ट्वीट्स से ट्रेंड्स — यह कैसे काम करता है
ml: ട്വീറ്റുകളിൽ നിന്ന് ട്രേഡുകളിലേക്ക് — ഡാഷ്ബോർഡ് (നിഫ്റ്റി 50)
mr: ट्विट्स ते ट्रेड्स — डॅशबोर्ड (निफ्टी 50)

source: From Tweets To Trades
hi: ट्वीट्स से ट्रेड्स
ml: ട്വീറ്റുകളിൽ നിന്ന് ട്രേഡുകളിലേക്ക്
mr: ट्विट्स ते ट्रेड्स

source: Select one NIFTY 50 company to generate insights
hi: इनसाइट्स प्राप्त करने के लिए निफ्टी 50 की एक कंपनी चुनें
ml: അവലോകനങ്ങൾ സൃഷ്ടിക്കാൻ ഒരു നിഫ്റ്റി 50 കമ്പനി തിരഞ്ഞെടുക്കുക
mr: अंतर्दृष्टी निर्माण करण्यासाठी एक निफ्टी 50 कंपनी निवडा

source: Sign out
hi: साइन आउट
ml: സൈൻ ഔട്ട്
mr: साइन आउट

source: Choose one company (NIFTY 50)
hi: एक कंपनी चुनें (निफ्टी 50)
ml: ഒരു കമ്പനി തിരഞ്ഞെടുക്കുക (നിഫ്റ്റി 50)
mr: एक कंपनी निवडा (निफ्टी 50)

source: -- Select a company --
hi: -- एक कंपनी चुनें --
ml: -- ഒരു കമ്പനി തിരഞ്ഞെടുക്കുക --
mr: -- कंपनी निवडा --

source: Tip: pick one ticker. Charts and news will update for the selected company.
hi: सुझाव: एक टिकर चुनें। चार्ट और समाचार चुनी गई कंपनी के अनुसार अपडेट होंगे।
ml: ടിപ്പ്: ഒരു ടിക്കർ മാത്രം തിരഞ്ഞെടുക്കുക. തിരഞ്ഞെടുക്കുന്ന കമ്പനിക്കായി ചാർട്ടുകളും വാർത്തകളും കാണിക്കപ്പെടും.
mr: टीप: एक टिकर निवडा. निवडलेल्या कंपनीसाठी चार्ट आणि बातम्या अपडेट होतील.

source: Generate Insights
hi: एआई आधारित इनसाइट्स
ml: അവലോകനങ്ങൾ സൃഷ്ടിക്കുക
mr: अंतर्दृष्टी तयार करा

source: Welcome!
hi: स्वागत है!
ml: സ്വാഗതം!
mr: स्वागत आहे!

source: Select a NIFTY 50 company to view charts, news, and predictions.
hi: चार्ट, समाचार और पूर्वानुमान देखने के लिए निफ्टी 50 की एक कंपनी चुनें।
ml: ചാർട്ടുകൾ, വാർത്തകൾ, പ്രവചനങ്ങൾ കാണാൻ ഒരു നിഫ്റ്റി 50 കമ്പനി തിരഞ്ഞെടുക്കുക.
mr: चार्ट, बातम्या आणि अंदाज पाहण्यासाठी निफ्टी 50 कंपनी निवडा.

source: 14-Day Price Prediction
hi: स्टॉक प्रेडिक्शन
ml: 14 ദിവസത്തെ വില പ്രവചനം
mr: 14 दिवसांचा किंमत अंदाज

source: Model: Ensemble • Confidence:
hi: मॉडल: एन्सेम्बल • विश्वास स्तर:
ml: മോഡൽ: എൻസെംബിൾ • ആത്മവിശ്വാസം:
mr: मॉडेल: एन्सेंबल • आत्मविश्वास:

source: Historical Price (Past 30 days)
hi: ऐतिहासिक मूल्य (पिछले 30 दिन)
ml: ചരിത്ര വില (കഴിഞ്ഞ 30 ദിവസം)
mr: ऐतिहासिक किंमत (मागील 30 दिवस)

source: Source: sample data
hi: स्रोत: नमूना डेटा
ml: ഉറവിടം: സാമ്പിൾ ഡാറ്റ
mr: स्रोत: नमुना डेटा

source: Predicted Values (14 Days)
hi: अनुमानित मूल्य (14 दिन)
ml: പ്രവചിച്ച മൂല്യങ്ങൾ (14 ദിവസം)
mr: अंदाजित मूल्ये (14 दिवस)

source: Click a tile to highlight
hi: हाइलाइट करने के लिए किसी टाइल पर क्लिक करें
ml: ഹൈലൈറ്റ് ചെയ്യാൻ ഒരു ടൈലിൽ ക്ലിക്ക് ചെയ്യുക.
mr: हायलाइट करण्यासाठी टाइलवर क्लिक करा

source: Latest News (—)
hi: ताज़ा समाचार (—)
ml: പുതിയ വാർത്തകൾ (—)
mr: ताज्या बातम्या (—)

source: Key Stats
hi: मुख्य आँकड़े
ml: പ്രധാന കണക്ക് വിവരങ്ങൾ
mr: महत्वाची आकडेवारी

source: Prototype — dropdown uses NIFTY 50 constituents (source: NIFTY / Wikipedia).
hi: प्रोटोटाइप — ड्रॉपडाउन में निफ्टी 50 कंपनियाँ (स्रोत: निफ्टी / विकिपीडिया)।
ml: പ്രോട്ടോടൈപ്പ് — ഡ്രോപ്പ്‌ഡൗൺ NIFTY 50യിലെ കമ്പനികളുടെ പട്ടിക (ഉറവിടം: NIFTY / Wikipedia) ഉപയോഗിക്കുന്നു.
mr: प्रोटोटाइप — ड्रॉपडाउनमध्ये निफ्टी 50 घटक वापरले आहेत (स्रोत: निफ्टी / विकिपीडिया).

source: FTTT - Market Alerts
hi: FTTT - मार्केट अलर्ट्स
ml: FTTT - മാർക്കറ്റ് അലർട്ടുകൾ
mr: FTTT - मार्केट अलर्ट्स

source: From Tweets
hi: ट्वीट्स से
ml: ട്വീറ്റുകളിൽ നിന്ന്
mr: ट्विट्सपासून

source: to Trades
hi: ट्रेड्स तक
ml: ട്രേഡുകളിലേക്ക്
mr: ट्रेड्सपर्यंत

source: Analysis
hi: विश्लेषण
ml: വിശകലനം
mr: विश्लेषण

source: Top Companies
hi: शीर्ष कंपनियाँ
ml: മികച്ച കമ്പനികൾ
mr: शीर्ष कंपन्या

source: How it Works
hi: यह कैसे काम करता है
ml: ഇത് എങ്ങനെ പ്രവർത്തിക്കുന്നു
mr: हे कसे कार्य करते

source: Sign Out
hi: साइन आउट
ml: സൈൻ ഔട്ട്
mr: साइन आउट

source: Sign In
hi: साइन इन
ml: സൈൻ ഇൻ
mr: साइन इन

source: Sign Up
hi: साइन अप
ml: സൈൻ അപ്പ്
mr: नोंदणी करा

source: Real-time • AI • Sentiment
hi: रीयल-टाइम • एआई • सेंटिमेंट
ml: റിയൽ-ടൈം • എഐ • സെന്റിമെന്റ്
mr: रिअल-टाइम • AI • भावना विश्लेषण

source: Never Miss a <span class="accent-text">Market-Moving</span><br>Moment Again
hi: कभी भी <span class="accent-text">मार्केट मूविंग</span><br>मौका न चूकें
ml: ഒരു <span class="accent-text">മാർക്കറ്റ് മാറ്റം സൃഷ്ടിക്കുന്ന</
mr: <span class="accent-text">बाजार हलवणारा</span><br>एकही क्षण पुन्हा कधीही चुकवू नका

source: From Tweets to Trades — convert social chatter into real-time trading signals and market alerts. Trusted by thousands of active traders and analysts.
hi: ट्वीट्स से ट्रेड्स — सोशल मीडिया की चर्चा को रीयल-टाइम ट्रेडिंग सिग्नल और मार्केट अलर्ट्स में बदलें। हजारों सक्रिय ट्रेडर्स और विश्लेषकों द्वारा विश्वसनीय।
ml: ട്വീറ്റുകളിൽ നിന്ന് ട്രേഡുകളിലേക്ക് — സോഷ്യൽ മീഡിയയിലെ ചർച്ചകളെ റിയൽ-ടൈം ട്രേഡിംഗ് സിഗ്നലുകളും മാർക്കറ്റ് അലർട്ടുകളും ആക്കി മാറ്റുക. ആയിരക്കണക്കിന് സജീവ ട്രേഡർമാരും വിശകലന വിദഗ്ധരും വിശ്വസിക്കുന്ന സേവനം.
mr: ट्विट्स ते ट्रेड्स — सोशल चर्चेला रिअल-टाइम ट्रेडिंग सिग्नल्स आणि मार्केट अलर्टमध्ये रूपांतरित करा. हजारो सक्रिय ट्रेडर्स आणि विश्लेषकांचा विश्वास.

source: User Friendly • 5-minute integration
hi: उपयोग में आसान • 5 मिनट में सेटअप
ml: ഉപയോഗിക്കാൻ എളുപ്പം • 5 മിനിറ്റിൽ സംയോജനം
mr: वापरकर्ता अनुकूल • 5 मिनिटांत एकत्रीकरण

source: LIVE INSIGHT
hi: लाइव इनसाइट
ml: ലൈവ് ഇൻസൈറ്റ്
mr: थेट अंतर्दृष्टी

source: Loading...
hi: लोड हो रहा है...
ml: ലോഡുചെയ്യുന്നു...
mr: लोड होत आहे...

source: Market Trend Analysis
hi: मार्केट ट्रेंड विश्लेषण
ml: മാർക്കറ്റ് ട്രെൻഡ് വിശകലനം
mr: बाजार ट्रेंड विश्लेषण

source: Continuously analyze market data to identify emerging trends and highlight sectors showing unusual momentum or investor attention.
hi: मार्केट डेटा का लगातार विश्लेषण करें ताकि उभरते ट्रेंड्स की पहचान हो सके और उन सेक्टर्स को हाइलाइट किया जा सके जहाँ असामान्य गतिविधि या निवेशकों का ध्यान हो।
ml: ഉയർന്ന് വരുന്ന പ്രവണതകൾ കണ്ടെത്താനും നിക്ഷേപകരുടെ ശ്രദ്ധ ആകർഷിക്കുന്ന മേഖലകൾ വ്യക്തമാക്കാനും വിപണി ഡാറ്റ തുടർച്ചയായി വിശകലനം ചെയ്യുന്നു.
mr: उदयास येणारे ट्रेंड ओळखण्यासाठी आणि असामान्य गती किंवा गुंतवणूकदारांचे लक्ष वेधणाऱ्या क्षेत्रांना हायलाइट करण्यासाठी बाजार डेटा सतत विश्लेषित करा.

source: AI-driven Insights
hi: एआई आधारित इनसाइट्स
ml: എഐ നിയന്ത്രിത അവലോകനങ്ങൾ
mr: AI आधारित अंतर्दृष्टी

source: Proprietary models filter noise and surface high-confidence trade ideas with sentiment and event scoring.
hi: उन्नत मॉडल शोर को हटाकर उच्च-विश्वसनीयता वाले ट्रेड आइडियाज प्रस्तुत करते हैं, सेंटिमेंट और इवेंट स्कोरिंग के साथ।
ml: സ്വകാര്യ മോഡലുകൾ അനാവശ്യ വിവരങ്ങൾ നീക്കം ചെയ്ത്, സെന്റിമെന്റും ഇവന്റ് വിലയിരുത്തലും അടിസ്ഥാനമാക്കി വിശ്വാസ്യതയുള്ള ട്രേഡ് ആശയങ്ങൾ അവതരിപ്പിക്കുന്നു.
mr: आमचे मालकी हक्काचे मॉडेल्स अनावश्यक डेटा फिल्टर करून उच्च आत्मविश्वास असलेले ट्रेड आयडिया भावना आणि इव्हेंट स्कोअरिंगसह सादर करतात.

source: Sentiment Tracking
hi: सेंटिमेंट ट्रैकिंग
ml: സെന്റിമെന്റ് ട്രാക്കിംഗ്
mr: अभिप्राय ट्रॅकिंग

source: Track sentiment trends across sectors and map social momentum to price movement with clear visualizations.
hi: विभिन्न सेक्टर्स में सेंटिमेंट ट्रेंड्स को ट्रैक करें और स्पष्ट विज़ुअलाइजेशन के साथ सोशल मोमेंटम को प्राइस मूवमेंट से जोड़ें।
ml: വിവിധ മേഖലകളിലെ സെന്റിമെന്റ് പ്രവണതകൾ നിരീക്ഷിച്ച്, സോഷ്യൽ മോമെന്റത്തെ വില മാറ്റങ്ങളുമായി വ്യക്തമായ ഗ്രാഫുകൾ വഴി ബന്ധിപ്പിക്കുക.
mr: विविध क्षेत्रांतील भावना ट्रेंड ट्रॅक करा आणि स्पष्ट दृश्य मांडणीद्वारे सामाजिक गतीचे किंमत हालचालींशी मॅपिंग करा.

source: Top Trending Companies
hi: शीर्ष ट्रेंडिंग कंपनियाँ
ml: ട്രെൻഡിംഗ് മികച്ച കമ്പനികൾ
mr: टॉप ट्रेंडिंग कंपन्या

source: Live social and market movement
hi: लाइव सोशल और मार्केट मूवमेंट
ml: തത്സമയ സോഷ്യൽ മീഡിയയും വിപണി ചലനങ്ങളും
mr: लाईव्ह सोशल आणि बाजार हालचाली

source: HDFC Bank
hi: एचडीएफसी बैंक
ml: HDFC ബാങ്ക്
mr: एचडीएफसी बँक

source: HDFC . Finance
hi: एचडीएफसी • वित्त
ml: HDFC . ഫിനാൻസ്
mr: एचडीएफसी • वित्त

source: Data Loading...
hi: डेटा लोड हो रहा है...
ml: ഡാറ്റ ലോഡുചെയ്യുന്നു...
mr: डेटा लोड होत आहे...

source: Reliance Ind.
hi: रिलायंस इंड.
ml: റിലയൻസ് ഇൻഡസ്ട്രീസ്
mr: रिलायंस इंड.

source: REL • Technology
hi: रिलायंस • टेक्नोलॉजी
ml: REL • ടെക്‌നോളജി
mr: रिलायंस • तंत्रज्ञान

source: TCS
hi: टीसीएस
ml: ടിസിഎസ്
mr: टीसीएस

source: TCS . IT Services
hi: टीसीएस • आईटी सेवाएँ
ml: ടിസിഎസ് • ഐടി സർവീസുകൾ
mr: टीसीएस • आयटी सेवा

source: ICICI
hi: आईसीआईसीआई
ml: ഐസിഐസിഐ
mr: आयसीआयसीआय

source: ICICI . Finance
hi: आईसीआईसीआई • वित्त
ml: ഐസിഐസിഐ • ഫിനാൻസ്
mr: आयसीआयसीआय • वित्त

source: From Tweets to Trends — How it works
hi: ट्वीट्स से ट्रेंड्स — यह कैसे काम करता है
ml: ട്വീറ്റുകളിൽ നിന്ന് ട്രെൻഡുകളിലേക്ക് — പ്രവർത്തന രീതി
mr: ट्विट्स ते ट्रेंड्स — हे कसे कार्य करते

source: Raw social chatter → signal processing → trade-ready alerts
hi: कच्ची सोशल चर्चा → सिग्नल प्रोसेसिंग → ट्रेड के लिए तैयार अलर्ट्स
ml: സോഷ്യൽ മീഡിയയിലെ അസംസ്കൃത ചർച്ചകൾ → സിഗ്നൽ വിശകലനം → ട്രേഡിംഗിന് തയ്യാറായ അലർട്ടുകൾ
mr: कच्ची सोशल चर्चा → सिग्नल प्रोसेसिंग → ट्रेडसाठी तयार अलर्ट्स

source: Collect
hi: संग्रह
ml: ശേഖരിക്കുക
mr: संकलन

source: We ingest tweets, threads, news, Reddit posts and message board chatter in real time across global feeds.
hi: हम ट्वीट्स, थ्रेड्स, न्यूज़, रेडिट पोस्ट्स और मैसेज बोर्ड की चर्चाओं को रीयल-टाइम में वैश्विक स्रोतों से एकत्र करते हैं।
ml: ലോകമെമ്പാടുമുള്ള ഫീഡുകളിൽ നിന്ന് ട്വീറ്റുകൾ, വാർത്തകൾ, റെഡിറ്റ് പോസ്റ്റുകൾ, മറ്റ് ഓൺലൈൻ ചർച്ചകൾ എന്നിവ തത്സമയം ശേഖരിക്കുന്നു.
mr: आम्ही जागतिक फीडमधून ट्विट्स, थ्रेड्स, बातम्या, Reddit पोस्ट्स आणि मेसेज बोर्ड चर्चा रिअल-टाइममध्ये संकलित करतो.

source: Filter & Classify
hi: फ़िल्टर और वर्गीकृत
ml: ഫിൽട്ടർ ചെയ്ത് വർഗ്ഗീകരിക്കുക
mr: फिल्टर आणि वर्गीकरण

source: Our NLP pipeline removes bots and noise, classifies event types, and tags tickers & topics automatically.
hi: हमारी NLP प्रणाली बॉट्स और अनावश्यक शोर को हटाती है, इवेंट प्रकारों को वर्गीकृत करती है और टिकर्स व टॉपिक्स को स्वचालित रूप से टैग करती है।
ml: ഞങ്ങളുടെ NLP പൈപ്പ്‌ലൈൻ ബോട്ടുകളും അനാവശ്യ ശബ്ദവും നീക്കം ചെയ്ത്, ഇവന്റ് തരങ്ങൾ വർഗ്ഗീകരിക്കുകയും ടിക്കറുകളും വിഷയങ്ങളും സ്വയമേവ ടാഗ് ചെയ്യുകയും ചെയ്യുന്നു.
mr: आमची NLP प्रणाली बॉट्स आणि अनावश्यक डेटा काढून टाकते, इव्हेंट प्रकारांचे वर्गीकरण करते आणि टिकर्स व विषयांना स्वयंचलित टॅग करते.

source: Score
hi: स्कोर
ml: സ്കോർ
mr: स्कोअर

source: Signals are scored for confidence, volume, and sentiment drift. Only high-impact signals generate alerts.
hi: सिग्नल्स को विश्वास स्तर, वॉल्यूम और सेंटिमेंट बदलाव के आधार पर स्कोर किया जाता है। केवल उच्च प्रभाव वाले सिग्नल्स अलर्ट उत्पन्न करते हैं।
ml: സിഗ്നലുകൾ വിശ്വാസ്യത, വോള്യം, സെന്റിമെന്റ് മാറ്റം എന്നിവയുടെ അടിസ്ഥാനത്തിൽ സ്കോർ ചെയ്യപ്പെടുന്നു. ഉയർന്ന സ്വാധീനമുള്ള സിഗ്നലുകൾക്ക് മാത്രമാണ് അലർട്ടുകൾ സൃഷ്ടിക്കപ്പെടുന്നത്.
mr: सिग्नल्सना आत्मविश्वास, व्हॉल्यूम आणि भावना बदल यानुसार स्कोअर दिला जातो. फक्त उच्च-प्रभाव सिग्नल्स अलर्ट निर्माण करतात.

source: Takes the historical data and sentiments in account for furhter analysis.
hi: आगे के विश्लेषण के लिए ऐतिहासिक डेटा और सेंटिमेंट को ध्यान में रखता है।
ml: കൂടുതൽ വിശകലനത്തിനായി ചരിത്ര ഡാറ്റയും സെന്റിമെന്റും പരിഗണിക്കുന്നു.
mr: पुढील विश्लेषणासाठी ऐतिहासिक डेटा आणि भावना विचारात घेतल्या जातात.

source: Stock Prediction
hi: स्टॉक प्रेडिक्शन
ml: ഓഹരി പ്രവചനം
mr: शेअर अंदाज

source: After thorough analysis, we can predict the stock price movement and suggest trades.
hi: गहन विश्लेषण के बाद, हम स्टॉक मूल्य की दिशा का अनुमान लगाते हैं और ट्रेड सुझाव देते हैं।
ml: വിശദമായ വിശകലനത്തിന് ശേഷം, ഓഹരി വിലയുടെ മാറ്റങ്ങൾ പ്രവചിച്ച് അനുയോജ്യമായ ട്രേഡുകൾ നിർദേശിക്കുന്നു.
mr: सखोल विश्लेषणानंतर आम्ही शेअर किंमत हालचालींचा अंदाज लावू शकतो आणि ट्रेड सुचवू शकतो.

source: Visualizations
hi: विज़ुअलाइजेशन
ml: ദൃശ്യവൽക്കരണം
mr: दृश्य मांडणी

source: See trend timelines, sentiment heatmaps, ad correlation views to validate ideas before trading.
hi: ट्रेड करने से पहले ट्रेंड टाइमलाइन, सेंटिमेंट हीटमैप और कोरिलेशन व्यू देखें।
ml: ട്രേഡിംഗിന് മുമ്പ് ആശയങ്ങൾ സ്ഥിരീകരിക്കാൻ ട്രെൻഡ് ടൈംലൈൻകൾ, സെന്റിമെന്റ് ഹീറ്റ്‌മാപ്പുകൾ, കൂടാതെ സഹബന്ധ (കോറലേഷൻ) ദൃശ്യങ്ങൾ പരിശോധിക്കുക.
mr: ट्रेडिंगपूर्वी कल्पना पडताळण्यासाठी ट्रेंड टाइमलाइन, भावना हीटमॅप्स आणि सहसंबंध दृश्ये पहा.

source: Ready to turn chatter into alpha?
hi: क्या आप चर्चा को मुनाफे में बदलने के लिए तैयार हैं?
ml: സോഷ്യൽ ചർച്ചകളെ ലാഭസാധ്യതയായ ആൽഫയാക്കി മാറ്റാൻ തയ്യാറാണോ?
mr: गप्पांना नफ्यात रूपांतर करण्यास तयार आहात?

source: Start a free trial — get alerts for your watchlist in minutes.
hi: फ्री ट्रायल शुरू करें — अपनी वॉचलिस्ट के लिए मिनटों में अलर्ट प्राप्त करें।
ml: സൗജന്യ പരീക്ഷണം ആരംഭിക്കുക — നിങ്ങളുടെ വാച്ച്‌ലിസ്റ്റിലെ ഓഹരികൾക്കായി ഏതാനും മിനിറ്റുകൾക്കകം അലർട്ടുകൾ നേടൂ.
mr: मोफत ट्रायल सुरू करा — काही मिनिटांत आपल्या वॉचलिस्टसाठी अलर्ट मिळवा.

source: Start Free Trial
hi: फ्री ट्रायल शुरू करें
ml: സൗജന്യ പരീക്ഷണം ആരംഭിക്കുക
mr: मोफत ट्रायल सुरू करा

source: From Tweets to Trades
hi: ट्वीट्स से ट्रेड्स
ml: ട്വീറ്റുകളിൽ നിന്ന് ട്രേഡുകളിലേക്ക്

source: Privacy Policy
hi: गोपनीयता नीति
ml: സ്വകാര്യതാ നയം
mr: गोपनीयता धोरण

source: Terms of Service
hi: सेवा की शर्तें
ml: സേവന നിബന്ധനകൾ
mr: अटी व शर्ती

source: Last updated: February 2026
hi: अंतिम अपडेट: फरवरी 2026
ml: അവസാനമായി പുതുക്കിയത്: ഫെബ്രുവരി 2026
mr: शेवटचे अद्यतन: फेब्रुवारी 2026

source: 1. Information We Collect
hi: 1. हम कौन सी जानकारी एकत्र करते हैं
ml: 1. ഞങ്ങൾ ശേഖരിക്കുന്ന വിവരങ്ങൾ
mr: 1. आम्ही कोणती माहिती संकलित करतो

source: We may collect basic account information such as your name, email address, and login credentials when you register on our platform.
hi: जब आप हमारे प्लेटफॉर्म पर पंजीकरण करते हैं, तो हम आपका नाम, ईमेल पता और लॉगिन विवरण जैसी बुनियादी जानकारी एकत्र कर सकते हैं।
ml: ഞങ്ങളുടെ പ്ലാറ്റ്ഫോമിൽ രജിസ്റ്റർ ചെയ്യുമ്പോൾ, നിങ്ങളുടെ പേര്, ഇമെയിൽ വിലാസം, ലോഗിൻ വിവരങ്ങൾ തുടങ്ങിയ അടിസ്ഥാന അക്കൗണ്ട് വിവരങ്ങൾ ഞങ്ങൾ ശേഖരിക്കുന്നു.
mr: आपण आमच्या प्लॅटफॉर्मवर नोंदणी करताना आपले नाव, ईमेल पत्ता आणि लॉगिन तपशील यांसारखी मूलभूत माहिती आम्ही संकलित करू शकतो.

source: 2. How We Use Your Information
hi: 2. हम आपकी जानकारी का उपयोग कैसे करते हैं
ml: 2. നിങ്ങളുടെ വിവരങ്ങൾ ഞങ്ങൾ എങ്ങനെ ഉപയോഗിക്കുന്നു
mr: 2. आम्ही आपली माहिती कशी वापरतो

source: Your information is used to provide stock analysis services, improve user experience, generate insights, and communicate important updates.
hi: आपकी जानकारी का उपयोग स्टॉक विश्लेषण सेवाएँ प्रदान करने, उपयोगकर्ता अनुभव बेहतर बनाने, इनसाइट्स उत्पन्न करने और महत्वपूर्ण अपडेट साझा करने के लिए किया जाता है।
ml: ഓഹരി വിശകലന സേവനങ്ങൾ നൽകുന്നതിനും, ഉപയോക്തൃ അനുഭവം മെച്ചപ്പെടുത്തുന്നതിനും, ഉൾക്കാഴ്ചകൾ സൃഷ്ടിക്കുന്നതിനും, പ്രധാനപ്പെട്ട അപ്‌ഡേറ്റുകൾ അറിയിക്കുന്നതിനും നിങ്ങളുടെ വിവരങ്ങൾ ഉപയോഗിക്കുന്നു.
mr: आपली माहिती शेअर विश्लेषण सेवा प्रदान करण्यासाठी, वापरकर्ता अनुभव सुधारण्यासाठी, अंतर्दृष्टी निर्माण करण्यासाठी आणि महत्त्वाच्या अपडेट्ससाठी वापरली जाते.

source: 3. Data Security
hi: 3. डेटा सुरक्षा
ml: 3. വിവരസുരക്ഷ
mr: 3. डेटा सुरक्षा

source: We implement appropriate security measures to protect your data from unauthorized access, alteration, or disclosure.
hi: हम आपके डेटा को अनधिकृत पहुँच, बदलाव या खुलासे से बचाने के लिए उचित सुरक्षा उपाय अपनाते हैं।
ml: അനധികൃത പ്രവേശനം, മാറ്റം, അല്ലെങ്കിൽ വെളിപ്പെടുത്തൽ എന്നിവയിൽ നിന്ന് നിങ്ങളുടെ ഡാറ്റ സംരക്ഷിക്കാൻ അനുയോജ്യമായ സുരക്ഷാ നടപടികൾ ഞങ്ങൾ നടപ്പിലാക്കുന്നു.
mr: आपला डेटा अनधिकृत प्रवेश, बदल किंवा उघड होण्यापासून सुरक्षित ठेवण्यासाठी आम्ही योग्य सुरक्षा उपाययोजना करतो.

source: 4. Third-Party Services
hi: 4. तृतीय-पक्ष सेवाएँ
ml: 4.⁠ ⁠മൂന്നാംകക്ഷി സേവനങ്ങൾ
mr: 4. तृतीय-पक्ष सेवा

source: Our platform may use third-party APIs such as market data providers. We are not responsible for their privacy practices.
hi: हमारा प्लेटफॉर्म मार्केट डेटा प्रदाताओं जैसी तृतीय-पक्ष API का उपयोग कर सकता है। उनकी गोपनीयता नीतियों के लिए हम जिम्मेदार नहीं हैं।
ml: ഞങ്ങളുടെ പ്ലാറ്റ്ഫോം മാർക്കറ്റ് ഡാറ്റ പ്രൊവൈഡർമാർ പോലുള്ള മൂന്നാംകക്ഷി APIകൾ ഉപയോഗിക്കാം. അവരുടെ സ്വകാര്യതാ നടപടികൾക്കായി ഞങ്ങൾ ഉത്തരവാദികളല്ല.
mr: आमचा प्लॅटफॉर्म बाजार डेटा प्रदाते यांसारख्या तृतीय-पक्ष API वापरू शकतो. त्यांच्या गोपनीयता धोरणांसाठी आम्ही जबाबदार नाही.

source: 5. Cookies
hi: 5. कुकीज़
ml: 5. കുക്കീസ്
mr: 5. कुकीज

source: We may use cookies to enhance user experience and maintain session authentication.
hi: हम उपयोगकर्ता अनुभव बेहतर बनाने और सत्र प्रमाणीकरण बनाए रखने के लिए कुकीज़ का उपयोग कर सकते हैं।
ml: ഉപയോക്തൃ അനുഭവം മെച്ചപ്പെടുത്താനും സെഷൻ ഓതന്റിക്കേഷൻ നിലനിർത്താനും ഞങ്ങൾ കുക്കികൾ ഉപയോഗിക്കാം.
mr: वापरकर्ता अनुभव सुधारण्यासाठी आणि सत्र प्रमाणीकरण राखण्यासाठी आम्ही कुकीज वापरू शकतो.

source: 6. Changes to This Policy
hi: 6. इस नीति में परिवर्तन
ml: 6. ഈ നയത്തിലെ മാറ്റങ്ങൾ
mr: 6. या धोरणातील बदल

source: We may update this Privacy Policy from time to time. Changes will be reflected on this page.
hi: हम समय-समय पर इस गोपनीयता नीति को अपडेट कर सकते हैं। परिवर्तन इस पृष्ठ पर प्रदर्शित होंगे।
ml: ഈ സ്വകാര്യതാ നയം ഞങ്ങൾ സമയാസമയങ്ങളിൽ പുതുക്കാം. മാറ്റങ്ങൾ ഈ പേജിൽ പ്രതിഫലിക്കും.
mr: आम्ही वेळोवेळी हे गोपनीयता धोरण अद्यतनित करू शकतो. बदल या पृष्ठावर दर्शवले जातील.

source: 7. Contact Us
hi: 7. हमसे संपर्क करें
ml: 7. ഞങ്ങളെ ബന്ധപ്പെടുക
mr: 7. आमच्याशी संपर्क साधा

source: If you have any questions regarding this Privacy Policy, please contact us through the platform.
hi: यदि इस गोपनीयता नीति के बारे में कोई प्रश्न है, तो कृपया प्लेटफॉर्म के माध्यम से हमसे संपर्क करें।
ml: ഈ സ്വകാര്യതാ നയവുമായി ബന്ധപ്പെട്ട് നിങ്ങൾക്ക് എന്തെങ്കിലും ചോദ്യങ്ങൾ ഉണ്ടെങ്കിൽ, ദയവായി പ്ലാറ്റ്ഫോം വഴി ഞങ്ങളെ ബന്ധപ്പെടുക.
mr: या गोपनीयता धोरणाबाबत काही प्रश्न असल्यास कृपया प्लॅटफॉर्मद्वारे आमच्याशी संपर्क साधा.

source: Back to Home
hi: होम पेज पर वापस जाएँ
ml: ഹോം പേജിലേക്ക് മടങ്ങുക
mr: मुख्यपृष्ठावर परत जा

source: FTTT – Sign In
hi: FTTT – साइन इन
ml: FTTT – സൈൻ ഇൻ
mr: FTTT – साइन इन

source: Welcome Back
hi: फिर से स्वागत है
ml: വീണ്ടും സ്വാഗതം
mr: पुन्हा स्वागत आहे

source: Sign in with Google
hi: Google से साइन इन करें
ml: ഗൂഗിളിലൂടെ സൈൻ ഇൻ ചെയ്യുക
mr: Google द्वारे साइन इन करा

source: FTTT –Sign In
ml: FTTT – സൈൻ ഇൻ

source: Email Address
hi: ईमेल पता
ml: ഇമെയിൽ വിലാസം
mr: ईमेल पत्ता

source: Password
hi: पासवर्ड
ml: പാസ്‌വേഡ്
mr: पासवर्ड

source: Don’t have an account? <a href="%(signup_url)s">Sign Up</a>
hi: क्या आपका खाता नहीं है? <a href="%(signup_url)s">साइन अप करें</a>
ml: അക്കൗണ്ട് ഇല്ലേ? <a href="%(signup_url)s">സൈൻ അപ്പ് ചെയ്യുക</a>
mr: खाते नाही? <a href="%(signup_url)s">नोंदणी करा</a>

source: FTTT – Sign Up
hi: FTTT – साइन अप
ml: FTTT – സൈൻ അപ്പ്
mr: FTTT – नोंदणी

source: Create Your Account
hi: अपना खाता बनाएं
ml: നിങ്ങളുടെ അക്കൗണ്ട് സൃഷ്ടിക്കുക
mr: आपले खाते तयार करा

source: Sign Up with Google
hi: Google से साइन अप करें
ml: ഗൂഗിള്‍ ഉപയോഗിച്ച് സൈൻ അപ്പ് ചെയ്യുക
mr: Google द्वारे नोंदणी करा

source: — or sign up with email —
hi: — या ईमेल से साइन अप करें —
ml: — അല്ലെങ്കിൽ ഇമെയിൽ ഉപയോഗിച്ച് സൈൻ അപ്പ് ചെയ്യുക —
mr: — किंवा ईमेलद्वारे नोंदणी करा —

source: Full Name
hi: पूरा नाम
ml: പൂർണ്ണ പേര്
mr: पूर्ण नाव

source: Enter your full name
hi: अपना पूरा नाम दर्ज करें
ml: നിങ്ങളുടെ പൂർണ്ണ പേര് നൽകുക
mr: आपले पूर्ण नाव प्रविष्ट करा

source: Must be 8+ characters
hi: कम से कम 8 अक्षर होने चाहिए
ml: കുറഞ്ഞത് 8 അക്ഷരങ്ങൾ വേണം
mr: किमान 8 किंवा अधिक अक्षरे असावीत

source: Already have an account?
hi: क्या आपके पास पहले से खाता है?
ml: ഇതിനകം ഒരു അക്കൗണ്ട് ഉണ്ടോ?
mr: आधीच खाते आहे?

source: Terms & Conditions
hi: नियम एवं शर्तें
ml: നിബന്ധനകളും വ്യവസ്ഥകളും
mr: अटी व शर्ती

source: 1. Acceptance of Terms
hi: 1. शर्तों की स्वीकृति
ml: 1. നിബന്ധനകളുടെ അംഗീകാരം
mr: 1. अटींची स्वीकृती

source: By accessing and using this platform, you agree to comply with these Terms & Conditions.
hi: इस प्लेटफॉर्म का उपयोग करके आप इन नियमों और शर्तों का पालन करने के लिए सहमत होते हैं।
ml: ഈ പ്ലാറ്റ്ഫോം ഉപയോഗിക്കുന്നതിലൂടെ, ഈ നിബന്ധനകളും വ്യവസ്ഥകളും പാലിക്കാൻ നിങ്ങൾ സമ്മതിക്കുന്നു.
mr: या प्लॅटफॉर्मचा वापर करून आपण या अटी व शर्तींचे पालन करण्यास सहमत आहात.

source: 2. Educational Purpose Only
hi: 2. केवल शैक्षणिक उद्देश्य के लिए
ml: 2. വിദ്യാഭ്യാസ ആവശ്യങ്ങൾക്ക് മാത്രം
mr: 2. फक्त शैक्षणिक उद्देशासाठी

source: All stock predictions, sentiment scores, and analytics provided on this platform are for educational and informational purposes only.
hi: इस प्लेटफॉर्म पर उपलब्ध सभी स्टॉक पूर्वानुमान, सेंटिमेंट स्कोर और विश्लेषण केवल शैक्षणिक और जानकारी के उद्देश्य से हैं।
ml: ഈ പ്ലാറ്റ്ഫോമിൽ നൽകുന്ന എല്ലാ ഓഹരി പ്രവചനങ്ങളും, സെന്റിമെന്റ് സ്കോറുകളും, വിശകലനങ്ങളും വിദ്യാഭ്യാസവും വിവരാവശ്യങ്ങൾക്കുമാത്രമാണ്.
mr: या प्लॅटफॉर्मवर दिलेले सर्व शेअर अंदाज, भावना स्कोअर आणि विश्लेषण केवळ शैक्षणिक व माहितीपर उद्देशासाठी आहेत.

source: 3. No Financial Advice
hi: 3. कोई वित्तीय सलाह नहीं
ml: 3. സാമ്പത്തിക ഉപദേശം അല്ല
mr: 3. आर्थिक सल्ला नाही

source: We do not provide financial, investment, or trading advice. Users are responsible for their own investment decisions.
hi: हम वित्तीय, निवेश या ट्रेडिंग सलाह प्रदान नहीं करते। उपयोगकर्ता अपने निवेश निर्णयों के लिए स्वयं जिम्मेदार हैं।
ml: ഞങ്ങൾ സാമ്പത്തിക, നിക്ഷേപ, അല്ലെങ്കിൽ ട്രേഡിംഗ് ഉപദേശം നൽകുന്നില്ല. ഉപയോക്താക്കൾ അവരുടെ നിക്ഷേപ തീരുമാനങ്ങൾക്ക് സ്വയം ഉത്തരവാദികളാണ്.
mr: आम्ही कोणताही आर्थिक, गुंतवणूक किंवा ट्रेडिंग सल्ला देत नाही. वापरकर्ते त्यांच्या गुंतवणूक निर्णयांसाठी स्वतः जबाबदार आहेत.

source: 4. User Responsibilities
hi: 4. उपयोगकर्ता की जिम्मेदारियाँ
ml: 4. ഉപയോക്താവിന്റെ ഉത്തരവാദിത്തങ്ങൾ
mr: 4. वापरकर्त्याच्या जबाबदाऱ्या

source: Users must provide accurate information during registration and maintain the confidentiality of their account credentials.
hi: उपयोगकर्ताओं को पंजीकरण के दौरान सही जानकारी प्रदान करनी चाहिए और अपने खाते की गोपनीय जानकारी सुरक्षित रखनी चाहिए।
ml: രജിസ്ട്രേഷൻ സമയത്ത് ഉപയോക്താക്കൾ കൃത്യമായ വിവരങ്ങൾ നൽകണം, കൂടാതെ അവരുടെ അക്കൗണ്ട് ക്രെഡൻഷ്യൽസ് രഹസ്യമായി സൂക്ഷിക്കണം.
mr: नोंदणी करताना वापरकर्त्यांनी अचूक माहिती द्यावी आणि त्यांच्या खात्याच्या तपशीलांची गोपनीयता राखावी.

source: 5. Limitation of Liability
hi: 5. उत्तरदायित्व की सीमा
ml: 5. ഉത്തരവാദിത്വത്തിന്റെ പരിമിതി
mr: 5. जबाबदारीची मर्यादा

source: We are not liable for any financial losses or damages resulting from the use of this platform.
hi: इस प्लेटफॉर्म के उपयोग से होने वाले किसी भी वित्तीय नुकसान या क्षति के लिए हम जिम्मेदार नहीं हैं।
ml: ഈ പ്ലാറ്റ്ഫോം ഉപയോഗിക്കുന്നതിലൂടെ ഉണ്ടാകുന്ന സാമ്പത്തിക നഷ്ടങ്ങൾക്കോ മറ്റ് നാശനഷ്ടങ്ങൾക്കോ ഞങ്ങൾ ഉത്തരവാദികളല്ല.
mr: या प्लॅटफॉर्मच्या वापरामुळे झालेल्या कोणत्याही आर्थिक नुकसानीसाठी आम्ही जबाबदार नाही.

source: 6. Modifications
hi: 6. संशोधन
ml: 6. ഭേദഗതികൾ
mr: 6. बदल

source: We reserve the right to modify or discontinue any part of the platform at any time without notice.
hi: हम बिना सूचना के प्लेटफॉर्म के किसी भी हिस्से में परिवर्तन या उसे बंद करने का अधिकार सुरक्षित रखते हैं।
ml: മുന്നറിയിപ്പ് നൽകാതെ, ഏതുസമയത്തും പ്ലാറ്റ്ഫോമിന്റെ ഏതെങ്കിലും ഭാഗം മാറ്റുകയോ നിർത്തലാക്കുകയോ ചെയ്യാനുള്ള അവകാശം ഞങ്ങൾ സംരക്ഷിക്കുന്നു.
mr: आम्हाला कोणत्याही वेळी पूर्वसूचना न देता प्लॅटफॉर्मचा कोणताही भाग बदलण्याचा किंवा बंद करण्याचा अधिकार आहे.

source: 7. Governing Law
hi: 7. लागू कानून
ml: 7. പ്രാബല്യത്തിലുള്ള നിയമം
mr: 7. लागू कायदा

source: These terms shall be governed by applicable laws of the jurisdiction in which the platform operates.
hi: ये शर्तें उस क्षेत्राधिकार के लागू कानूनों द्वारा शासित होंगी जहाँ प्लेटफॉर्म संचालित होता है।
ml: പ്ലാറ്റ്ഫോം പ്രവർത്തിക്കുന്ന അധികാരപരിധിയിലെ പ്രാബല്യത്തിലുള്ള നിയമങ്ങൾ അനുസരിച്ചാണ് ഈ നിബന്ധനകൾ നിയന്ത്രിക്കപ്പെടുന്നത്.
mr: या अटी प्लॅटफॉर्म कार्यरत असलेल्या क्षेत्रातील लागू कायद्यांनुसार नियंत्रित केल्या जातील.

source: English
hi: अंग्रेज़ी
ml: ഇംഗ്ലീഷ്
mr: इंग्रजी

source: Hindi
hi: हिन्दी
ml: ഇംഗ്ലീഷ്
mr: हिंदी

source: Marathi
ml: മറാത്തി
mr: मराठी

source: Malayalam
ml: മലയാളം

source: — or sign in with email —
hi: — या ईमेल से साइन इन करें —
mr: — किंवा ईमेलद्वारे साइन इन करा —
